export default [
    "",
    {
        title: "国科大部分课程笔记",
        collapsable: false,
        children: [
            "A*算法",
            "web安全技术",
            "模式识别与机器学习",
            "深度学习期末笔记",
            "深度学习考试",
            "科技信息检索",
            "移动互联网",
            "移动互联网2023知识点总结",
            "计算机体系结构",
            "马尔可夫决策",
            "高级人工智能",
        ],
    },
];
//     [A*算法](A*算法.md)
//
//     [web安全技术](web安全技术.md)
//
//     [模式识别与机器学习](模式识别与机器学习.md)
//
//     [深度学习期末笔记](深度学习期末笔记.md)
//
//     [深度学习考试](深度学习考试.md)
//
//     [科技信息检索](科技信息检索.md)
//
//     [移动互联网](移动互联网.md)
//
//     [移动互联网2023知识点总结](移动互联网2023知识点总结.md)
//
//     [计算机体系结构](计算机体系结构.md)
//
//     [马尔可夫决策](马尔可夫决策.md)
//
//     [高级人工智能](高级人工智能.md)